Revit 2027 API
SpatialFieldManager.LegendShowDescription Property
 If true legend contains analysis description.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool LegendShowDescription { get; set; }
Public Property LegendShowDescription As Boolean
	Get
	Set
public:
property bool LegendShowDescription {
	bool get ();
	void set (bool value);
}
member LegendShowDescription : bool with get, set
Property Value
Boolean
See Also
Reference
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace